"use client";

import React from "react";

export default function SystemExplanation() {
  return (
   <section className="w-full border-t border-white/10 bg-white/5">
  <div className="px-4 md:px-16 lg:px-24 xl:px-32 py-24">
    <div className="max-w-[1100px]">
      <p className="text-xs uppercase tracking-wider text-slate-400">
        Што значи ова за вашиот бизнис
      </p>

      <h2 className="mt-3 text-2xl md:text-3xl font-medium text-white">
        Флексибилен систем кој се прилагодува
      </h2>

      <div className="mt-8 space-y-5 text-base md:text-lg leading-relaxed text-slate-200">
        <p>
          Ова не е готов проект, туку флексибилен систем кој се прилагодува според
          потребите на вашиот бизнис.
        </p>

        <p>
          Секој дел – од закажување на термини, до услуги, тим и информации за
          пациентите – може да се прилагоди според начинот на кој вие работите.
        </p>

        <p>
          Системот може да се користи како едноставна веб страна или да се прошири
          во целосна платформа со повеќе функционалности, во зависност од вашите
          цели и обемот на проектот.
        </p>

       
        <p>
          Содржината, страниците и функционалностите не се фиксни. Тие се дефинираат
          според вашиот тип на бизнис, процесите кои веќе ги имате и начинот на
          комуникација со клиентите.
        </p>

        <p>
             Добро структурираната веб страна овозможува полесно пронаоѓање на вашите услуги преку интернет, што придонесува за поголема свест кај потенцијалните клиенти и подобра препознатливост на вашиот бренд.
        </p>

        <p className="text-slate-100 font-medium">
          Целта е да се изгради решение кое ќе ви заштеди време, ќе ја олесни
          организацијата и ќе обезбеди подобро искуство за вашите клиенти или пациенти.
        </p>

        <p>
            Доколку постои интерес, системот може дополнително да се прошири и со е-трговија.
Ова овозможува онлајн продажба и дистрибуција на стоматолошки алати, производи или опрема, со целосна контрола врз понудата, нарачките и комуникацијата со клиентите.
        </p>

        <p className="mt-10 text-sm text-slate-400">
        Секогаш тука за добар дизајн и паметни решенија.{" "}
        <a
         href="https://mitrevdarko.dev"
        target="_blank"
         rel="noopener noreferrer"
         className="text-indigo-400 hover:text-indigo-300 "
         >
         MitrevDesign
        </a>
    </p>

      </div>
    </div>
  </div>
</section>

  );
}


